// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, 
// является ли число чётным (делится ли оно на два без остатка).

// 4 -> да
// -3 -> нет
// 7 -> нет

Console.WriteLine("Программа, определяющая четное или не четное число ввел пользователь.");
Console.Write("Введите число: ");
int numberA = Convert.ToInt32(Console.ReadLine());
if (numberA % 2 == 0)
{
    Console.WriteLine($"Число {numberA} четное.");
}
else
{
    Console.WriteLine($"Число {numberA} не четное.");
}

